v002-stationary/constant/water/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/water/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    water_inlet
    {
        type            patch;
        nFaces          15;
        startFace       11585;
    }
    water_outlet
    {
        type            patch;
        nFaces          15;
        startFace       11600;
    }
    water_wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          6000;
        startFace       11615;
    }
    water_wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          6000;
        startFace       17615;
    }
    water_to_rock
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          400;
        startFace       23615;
        sampleMode      nearestPatchFace;
        sampleRegion    rock;
        samplePatch     rock_to_water;
    }
)

// ************************************************************************* //
